[

  {
    "url": "https://www.onlinejobs.ph/jobseekers/job/RPA-Specialist-1210131",
    "title": "RPA Specialist",
    "date": " Aug 22, 2024 ",
    "description": "\nWe are seeking a skilled and experienced Robotic Process Automation (RPA) Specialist to join our team. The ideal candidate will be responsible for designing, developing, and implementing RPA solutions to streamline business processes, increase efficiency, and reduce operational costs across our organization.\n\nKey Responsibilities\n- Analyze existing business processes and identify opportunities for automation\n- Design and develop RPA solutions using tools such as UiPath, Blue Prism, or Automation Anywhere\n- Collaborate with business stakeholders to gather requirements and translate them into technical specifications\n- Create process definition documents (PDDs) and solution design documents (SDDs)\n- Develop, test, and deploy RPA bots to automate repetitive tasks and workflows\n- Ensure the quality and performance of RPA solutions through thorough testing and debugging\n- Provide technical support and troubleshooting for implemented RPA solutions\n- Stay updated on the latest RPA technologies and best practices\n- Train and mentor junior team members on RPA development and best practices\n- Monitor and optimize the performance of RPA bots and processes\n- Collaborate with IT teams to ensure proper integration of RPA solutions with existing systems\n\nQualifications\n- 2-3+ years of experience in RPA development and implementation\n- Strong proficiency in at least one major RPA platform (UiPath, Blue Prism, or Automation Anywhere)\n- Experience with process analysis and optimization\n- Solid understanding of business process management concepts\n- Familiarity with programming languages such as VB.NET, C#, or Python\n- Knowledge of SQL and database management systems\n- Strong analytical and problem-solving skills\n- Excellent communication and interpersonal skills\n- Ability to work independently and as part of a team\n\nPreferred Qualifications\n- RPA certifications (e.g., UiPath Certified Professional, Blue Prism Developer, Automation Anywhere Certified Advanced RPA Professional)\n- Experience with process mining tools\n- Knowledge of AI and machine learning concepts\n- Familiarity with Agile methodologies\n\nBenefits:\n\n-PTO (Vacation Leave) that increases every year that you are with us\n-Separate PTO for Sick Leave\n-Maternity and Paternity Leave\n-Bereavement Leave\n-Evaluation and opportunity for raises every 4 months from start date.\n-Opportunity! All our positions have multi-tiered levels so you can get promoted in a matter of months. You get a detailed breakdown of what the qualifications are for every position and their respected levels, as well as the requirements and responsibilities that come with them.\n\n\nHow To Apply: Copy the link below and fill out the form.\nforms.zohopublic.com/mpowersolutions/form/JobApplication/formperma/cv0GXCrF6ovWYHFSHBBY1OL904iFdDWVfjM7nc7wKkY ",
    "found_keywords": [
      "python",
      "automation",
      "sql"
    ]
  },
  {
    "url": "https://www.onlinejobs.ph/jobseekers/job/Strategic-Sr-WordPress-Developer-Full-Time-Perks-1016648",
    "title": "»»» Strategic Sr. WordPress Developer × Full-Time Perks! «««",
    "date": " Aug 22, 2024 ",
    "description": "\nAs a Senior WordPress Developer, you will ensure our sites run smoothly and perform optimally. You will drive business growth through development and integration, ensuring our business system applications deliver measurable value. As the go-to expert for our web solutions, you will leverage your skills in development, testing, and deployment to achieve outstanding results.\n\nKey Responsibilities:\n-Maintain and enhance company-owned websites.\n-Handle specialized and ad hoc requests for research, technical information, and customized solutions.\n-Develop solutions to problems using a disciplined development process.\n-Quickly and independently learn new technologies and evaluate new plugins and tools.\n-Research best practices and recommend solutions.\n-Design using the latest WordPress environment and follow best practices in development, testing, and deployment.\n-Code WordPress themes and plugins from scratch.\n\nQualifications:\n-4 to 7 years of demonstrated on-the-job programming experience\n-3 to 5 years of WordPress development experience\n-Strong understanding of information systems and application architecture standards\n-In-depth knowledge of CSS, HTML5, and other front-end technologies\n-Proficiency in web-based programming languages (JavaScript, PHP, etc.)\n-Comfortable with both OOP and procedural programming methodologies\n-Knowledge of database design and troubleshooting\n-Experience with MySQL database management\n-Experience with Elementor and Genesis Framework\n-Expertise in WordPress, specifically:\n-Child Themes\n-Custom Post Types\n-Advanced Custom Fields\n-Syncing DEV and PROD environments\n-Hooks/Actions/Filters\n-Debugging/Security\n-Ability to convert PSD mock-ups to posts and pages\n-Basic SEO knowledge\n-Familiarity with responsive design and website speed optimization\n\nBasic Requirements:\n-Device Specifications: Intel i5 processor or higher with a minimum of 8GB RAM\n-Equipment: Webcam, speakers, and a microphone or headphones\n-Internet Speed: Minimum of 100Mbps with a backup connection for outages\n\nWork Details:\nWorking Hours: Monday to Friday, 8 AM to 5 PM Pacific Standard Time | Tuesday to Saturday, 12 AM to 8 AM Manila Time\nLocation: Anywhere in the Philippines\n\nWhy Join Us?\n-Stable employment\n-Competitive salary\n-Bi-monthly salary\n-A-Z benefits, including bonuses and annual raises\n-Work-life balance \n-Work-from-home opportunity\n\n*** The company uses a time tracker and maintains a virtual office setup via Google Meet.\nFor interested applicants, kindly send your CV to hr@arashlaw.ph or here at arashlaw.ph/apply/\n\n(Note: DO NOT SEND YOUR APPLICATION through our websites or social media platforms. FAILURE TO COMPLY WITH THIS INSTRUCTION may result in DISQUALIFICATION) ",
    "found_keywords": [
      "sql",
      "requests"
    ]
  },
  {
    "url": "https://www.onlinejobs.ph/jobseekers/job/Assistant-Property-Manager-for-a-Real-Estate-Company-1148191",
    "title": "Assistant Property Manager for a Real Estate Company",
    "date": " Aug 22, 2024 ",
    "description": "\nA well established, rapidly growing residential real estate company in the District of Columbia is seeking 2 Assistant Property Managers who are responsible, organized, detail oriented, and reliable to join our fun/hard working team. You must have excellent communication skills.\n\nDuties and Responsibilities:\n\n- Request Proposals.\n- Execute Building Repairs & Maintenance.\n- Create/Update Work Orders.\n- Search and Provide Information the Boards ask for from the Assistant Property Manager.\n- File Documents.\n- Assist with Homeowner Inquirement.\n- Assist with Insurance Related Items.\n- Updated Service Contracts.\n- New Tenant Leases.\n- Budget Tasks.\n- File Management.\n- Handle Check Requests.\n- Review Accounts.\n- Complete Date Entry for clients.\n- Invoice Research.\n- Audit Requests.\n- Payment Arrangements for Utility Bills.\n- Experience in HOA Management is a PLUS, but NOT required.\n- Must have at least 1 year of remote working experience.\n\nWorking Hours: 9:00 am – 5:00 pm EST; Monday – Friday\n\nBenefits:\n\nHMO and PTOs after 90 days.\n\nHow to apply:\n\n1. Please check out website: www.ejfrealestate.com\n2. Send me an email attachment with you updated resume in PDF format.\n3. Please indicate that you're comfortable to start with $5 USD per hour.\n\nKindly send your application to christine.ledesma@ejfrealestate.com. On the subject line, kindly indicate the position Assistant Property Manager - your name.\n\n*Applicants who will apply through onlinejobs.ph will not be considered. ",
    "found_keywords": [
      "requests"
    ]
  }
]
